app/controllers/courses_controller.rb

  def create
    @course = Course.new(params[:course])

    @course.save
---
INSERT INTO "courses" ("campus", "courseCode", "created_at", "description", "endDate", "endTime", "fri", "instructor", "mon", "name", "notes", "room", "sat", "startDate", "startTime", "sun", "thu", "tue", "updated_at", "wed") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"